// Маппинг ISO 3166-2 кода штата → GeoNames adminCode1
// Нужен ТОЛЬКО для стран где коды отличаются от ISO
// Для большинства стран (DE, FR, GB, US, AU и т.д.) ISO код = GeoNames adminCode1

module.exports = {
  // Россия — числовые коды в GeoNames
  RU: {
    'ALT': '22', 'AL': '04', 'AMU': '28', 'ARK': '29', 'AST': '30',
    'BEL': '31', 'BRY': '32', 'CE': '20', 'CHE': '74', 'CHU': '87',
    'CU': '21', 'DA': '05', 'IRK': '38', 'IVA': '37', 'YEV': '79',
    'KB': '07', 'KGD': '39', 'KLU': '40', 'KAM': '41', 'KC': '09',
    'KEM': '42', 'KHA': '27', 'KHM': '86', 'KIR': '43', 'KK': '19',
    'KL': '08', 'KO': '11', 'KOS': '44', 'KR': '10', 'KRS': '46',
    'KYA': '24', 'LEN': '47', 'LIP': '48', 'MAG': '49', 'ME': '12',
    'MO': '13', 'MOS': '50', 'MOW': '48', 'MUR': '51', 'NEN': '83',
    'NGR': '53', 'NIZ': '52', 'NVS': '54', 'OMS': '55', 'ORE': '56',
    'ORL': '57', 'PER': '59', 'PNZ': '58', 'PRI': '25', 'PSK': '60',
    'ROS': '61', 'RYA': '62', 'SA': '98', 'SAK': '65', 'SAM': '63',
    'SAR': '64', 'SE': '15', 'SMO': '67', 'SPE': '66', 'STA': '26',
    'SVE': '66', 'TAM': '68', 'TA': '16', 'TOM': '70', 'TUL': '71',
    'TVE': '69', 'TY': '17', 'TYU': '78', 'UD': '18', 'ULY': '73',
    'VGG': '34', 'VLA': '33', 'VLG': '35', 'VOR': '36', 'YAN': '89',
    'YAR': '76', 'ZAB': '75', 'IN': '06', 'BA': '02', 'BU': '03', 'AD': '01',
  },

  // Китай — числовые коды в GeoNames
  CN: {
    'AH': '01', 'BJ': '22', 'CQ': '33', 'FJ': '07', 'GD': '30',
    'GS': '16', 'GX': '08', 'GZ': '13', 'HA': '09', 'HB': '12',
    'HE': '10', 'HI': '31', 'HJ': '03', 'HN': '11', 'JL': '04',
    'JS': '04', 'JX': '15', 'LN': '05', 'NM': '23', 'NX': '28',
    'QH': '18', 'SC': '32', 'SD': '25', 'SH': '23', 'SN': '26',
    'SX': '27', 'TJ': '22', 'XJ': '29', 'XZ': '14', 'YN': '34',
    'ZJ': '36',
  },

  // Индия — числовые коды в GeoNames
  IN: {
    'AN': '01', 'AP': '02', 'AR': '30', 'AS': '03', 'BR': '04',
    'CH': '05', 'CT': '33', 'DD': '25', 'DL': '07', 'DN': '26',
    'GA': '10', 'GJ': '11', 'HP': '13', 'HR': '12', 'JH': '34',
    'JK': '14', 'KA': '19', 'KL': '18', 'LA': '37', 'LD': '31',
    'MH': '16', 'ML': '17', 'MN': '14', 'MP': '15', 'MZ': '15',
    'NL': '20', 'OR': '21', 'PB': '22', 'PY': '32', 'RJ': '24',
    'SK': '29', 'TG': '36', 'TN': '25', 'TR': '26', 'UP': '27',
    'UT': '35', 'WB': '28',
  },
};
